let stations = [{
        name: "默认测试线",
        data: [
            [0, 0, "测试站0"],
            [1, 1, "测试站1"],
            [2, 1, "测试站2"],
            [3, 1, "测试站3"],
            [4, 1, "测试站4"],
            [5, 1, "测试站5"],
            [6, 1, "测试站6"],
            [7, 1, "测试站7"],
            [8, 1, "测试站8"],
            [9, 1, "测试站9"],
            [10, 1, "测试站10"],
            [11, 1, "测试站11"],
            [12, 1, "测试站12"],
            [13, 1, "测试站13"],
            [14, 1, "测试站14"],
            [15, 1, "测试站15"],
            [16, 1, "测试站16"],
            [17, 1, "测试站17"],
            [18, 1, "测试站18"],
            [19, 1, "测试站19"],
            [20, 1, "测试站20"]
        ]
    },
    {
        name: "首都机场线",
        data: [
            [0, 0, "T2航站楼"],
            [1, 0.6, "T3航站楼"],
            [2, 2, "三元桥"],
            [3, 0.4, "东直门"],
        ]
    },
    {
        name: "北京轨道交通7号线",
        data: [
            [0, 0, "北京西站"],
            [1, 3.7, "湾子站"],
            [2, 2.5, "达官营站"],
            [3, 4.2, "广安门内站"],
            [4, 3.5, "菜市口站"],
            [5, 2.7, "虎坊桥站"],
            [6, 3.1, "珠市口站"],
            [7, 2.7, "桥湾站"],
            [8, 2.8, "磁器口站"],
            [9, 3.1, "广渠门内站"],
            [10, 3.4, "广渠门外站"],
            [11, 3.3, "双井站"],
            [12, 3.4, "九龙山站"],
            [13, 2.6, "大郊亭站"],
            [14, 2.6, "百子湾站"],
            [15, 2.8, "化工站"],
            [16, 3.5, "南楼梓庄站"],
            [17, 2.7, "欢乐谷景区站"],
            [18, 3.9, "垡头站"],
            [19, 3.2, "双合站"],
            [20, 2, "焦化厂车辆段"],
            [21, 2.8, "焦化厂站"],
            [22, 4, "黄厂村站"],
            [23, 4.2, "豆各庄站"],
            [24, 5.2, "黑庄户站"],
            [25, 5.9, "万盛南街西口站"],
            [26, 4.6, "云景东路站"],
            [27, 3, "小马庄站"],
            [28, 3.1, "高楼金站"],
            [29, 3.8, "张家湾停车场"],
            [30, 4, "施园站"],
            [31, 4, "环球影城站"],
        ]
    },
    {
        name: "北京轨道交通19号线",
        data: [
            [0, 0, "新宫站"],
            [1, 1, "新发地站"],
            [2, 1, "草桥站"],
            [3, 1, "右安门外站"],
            [4, 1, "牛街站"],
            [5, 1, "金融街站"],
            [6, 1, "平安里站"],
            [7, 1, "积水潭站"],
            [8, 1, "北太平庄站"],
            [9, 1, "牡丹园站"],
            [10, 1, "新宫车辆段"],
        ]
    },
    {
        name: "北京轨道交通28号线",
        data: [
            [0, 0, "东大桥站"],
            [1, 1, "京广桥站"],
            [2, 1, "光华路站"],
            [3, 1, "核心区站"],
            [4, 1, "大望路站"],
            [5, 1, "北京东站"],
            [6, 1, "大郊亭站"],
            [7, 1, "广渠路站"],
            [8, 1, "广渠东路站"],
        ]
    },
    {
        name: "北京轨道交通7号线",
        data: [
            [0, 0, "北京西站"],
            [1, 3.7, "湾子站"],
            [2, 2.5, "达官营站"],
            [3, 4.2, "广安门内站"],
            [4, 3.5, "菜市口站"],
            [5, 2.7, "虎坊桥站"],
            [6, 3.1, "珠市口站"],
            [7, 2.7, "桥湾站"],
            [8, 2.8, "磁器口站"],
            [9, 3.1, "广渠门内站"],
            [10, 3.4, "广渠门外站"],
            [11, 3.3, "双井站"],
            [12, 3.4, "九龙山站"],
            [13, 2.6, "大郊亭站"],
            [14, 2.6, "百子湾站"],
            [15, 2.8, "化工站"],
            [16, 3.5, "南楼梓庄站"],
            [17, 2.7, "欢乐谷景区站"],
            [18, 3.9, "垡头站"],
            [19, 3.2, "双合站"],
            [20, 2, "焦化厂车辆段"],
            [21, 2.8, "焦化厂站"],
            [22, 4, "黄厂村站"],
            [23, 4.2, "豆各庄站"],
            [24, 5.2, "黑庄户站"],
            [25, 5.9, "万盛南街西口站"],
            [26, 4.6, "云景东路站"],
            [27, 3, "小马庄站"],
            [28, 3.1, "高楼金站"],
            [29, 3.8, "张家湾停车场"],
            [30, 4, "施园站"],
            [31, 4, "环球影城站"],
        ]
    },
    {
        name: "北京轨道交通11号线西段",
        data: [
            [0, 0, "模式口站"],
            [1, 1, "金安桥站"],
            [2, 1, "北辛安站"],
            [3, 1, "新首钢站"],
        ]
    },
    {
        name: "北京轨道交通燕房线",
        data: [
            [0, 0, "燕化站"],
            [1, 1, "老城区站"],
            [2, 1, "饶乐府站"],
            [3, 1, "顾八路站"],
            [4, 1, "阎富路站"],
            [5, 1, "星城站"],
            [6, 1, "阎村站"],
            [7, 1, "大紫草坞"],
            [8, 1, "阎村北站"]
        ]
    },
    {
        name: "北京轨道交通燕房线场段",
        data: [
            [0, 0, "燕化站"],
            [1, 1, "老城区站"],
            [2, 1, "饶乐府站"],
            [3, 1, "顾八路站"],
            [4, 1, "阎富路站"],
            [5, 1, "星城站"],
            [6, 1, "阎村站"],
            [7, 1, "大紫草坞"],
            [8, 1, "阎村北站"]
        ]
    },
    {
        name: "厦门轨道交通3号线",
        data: [
            [0, 0, "厦门火车站"],
            [1, 1, "湖滨东路站"],
            [2, 1, "体育中心站"],
            [3, 1, "人才中心站"],
            [4, 1, "湖里公园站"],
            [5, 1, "华容路站"],
            [6, 1, "火炬园站"],
            [7, 1, "小东山站"],
            [8, 1, "安兜站"],
            [9, 1, "坂尚站"],
            [10, 1, "五缘湾车辆段"],
            [11, 1, "湖里创新园站"],
            [12, 1, "五缘湾站"],
            [13, 1, "体育会展站"],
            [14, 1, "东界站"],
            [15, 1, "洪坑站"],
            [16, 1, "林前站"],
            [17, 1, "洋塘站"],
            [18, 1, "翔安市民公园"],
            [19, 1, "浦边站"],
            [20, 1, "后村站"],
            [21, 1, "蔡厝站"],
            [22, 1, "蔡厝车辆段"],
        ]
    },
    {
        name: "北京轨道交通房山线",
        data: [
            [0, 0, "阎村车辆段"],
            [1, 1, "阎村东"],
            [2, 1, "苏庄"],
            [3, 1, "良乡南关"],
            [4, 1, "良乡大学城西"],
            [5, 1, "良乡大学城"],
            [6, 1, "良乡大学城北"],
            [7, 1, "广阳城"],
            [8, 1, "篱笆房"],
            [9, 1, "长阳"],
            [10, 1, "稻田"],
            [11, 1, "大葆台"],
            [12, 1, "郭公庄"],
            [13, 1, "白盆窑"],
            [14, 1, "花乡东桥"],
            [15, 1, "首经贸"],
            [16, 1, "东管头南"],
        ]
    }
]

/**
 * 获取车站
 * @param {*} currentLine 
 * @returns 
 */
function getStations(currentLine) {
    var stationTMP = JSON.parse(JSON.stringify(stations)); // 重新进入运行图页面，stations已被修改，此处使用临时数据传递查询后结果
    let station = stationTMP.find(s => {
        return s.name == currentLine;
    });

    station = station ? station : stationTMP[0];
    console.log(station);
    return station.data;
}

/**
 * 以对象形式获取车站
 * @param {*} currentLine 
 */
function getStationsObj(currentLine) {
    let station = stations.find(s => {
        return s.name == currentLine;
    });
    let result = {};
    let index = 1;
    if (station) {
        station.data.forEach(item => {
            result[item[2]] = index++;
        });
    }
    return result;
}

/**
 * 以对象形式获取车站
 * @param {*} currentLine 
 */
function getStationsObjIdProp(currentLine) {
    let station = stations.find(s => {
        return s.name == currentLine;
    });
    let result = {};
    let index = 1;
    if (station) {
        station.data.forEach(item => {
            result[item[0] + 1] = item[2];
        });
    }
    return result;
}

export { getStations, getStationsObj, getStationsObjIdProp }