export let c16 = [
    {
        "id": 1,
        "name": "北安河站",
        "x": 0,
        "width": 310
    },
    {
        "id": 2,
        "name": "温阳路站",
        "x": 310,
        "width": 190
    },
    {
        "id": 3,
        "name": "稻香湖路站",
        "x": 500,
        "width": 210
    },
    {
        "id": 4,
        "name": "屯佃站",
        "x": 710,
        "width": 190
    },
    {
        "id": 5,
        "name": "永丰站",
        "x": 900,
        "width": 290
    },
    {
        "id": 6,
        "name": "永丰南站",
        "x": 1190,
        "width": 190
    },
    {
        "id": 7,
        "name": "西北旺站",
        "x": 1380,
        "width": 190
    },
    {
        "id": 8,
        "name": "马连洼站",
        "x": 1570,
        "width": 300
    },
    {
        "id": 9,
        "name": "农大南路站",
        "x": 1870,
        "width": 190
    },
    {
        "id": 10,
        "name": "西苑站",
        "x": 2060,
        "width": 200
    },
    {
        "id": 11,
        "name": "万泉河桥站",
        "x": 2260,
        "width": 220
    },
    {
        "id": 12,
        "name": "苏州街站",
        "x": 2480,
        "width": 320
    },
    {
        "id": 13,
        "name": "苏州桥站",
        "x": 2800,
        "width": 190
    },
    {
        "id": 14,
        "name": "万寿寺站",
        "x": 2990,
        "width": 190
    },
    {
        "id": 15,
        "name": "国家图书馆站",
        "x": 3180,
        "width": 240
    },
    {
        "id": 16,
        "name": "二里沟站",
        "x": 3420,
        "width": 190
    },
    {
        "id": 17,
        "name": "甘家口站",
        "x": 3610,
        "width": 320
    },
    {
        "id": 18,
        "name": "玉渊潭东门站",
        "x": 3930,
        "width": 230
    },
    {
        "id": 19,
        "name": "木樨地站",
        "x": 4160,
        "width": 200
    },
    {
        "id": 20,
        "name": "达官营站",
        "x": 4360,
        "width": 190
    },
    {
        "id": 21,
        "name": "红莲南里站",
        "x": 4550,
        "width": 210
    },
    {
        "id": 22,
        "name": "丽泽商务区站",
        "x": 4760,
        "width": 240
    },
    {
        "id": 23,
        "name": "丰益桥南站",
        "x": 5000,
        "width": 240
    },
    {
        "id": 24,
        "name": "丰台站",
        "x": 5240,
        "width": 260
    },
    {
        "id": 25,
        "name": "丰台南路站",
        "x": 5500,
        "width": 230
    },
    {
        "id": 26,
        "name": "富丰桥站",
        "x": 5730,
        "width": 200
    },
    {
        "id": 27,
        "name": "看丹站",
        "x": 5930,
        "width": 190
    },
    {
        "id": 28,
        "name": "榆树庄站",
        "x": 6120,
        "width": 280
    },
    {
        "id": 29,
        "name": "宛平城站",
        "x": 6400,
        "width": 390
    }
];

